jmeter/results/report_200/statistics.json
{
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 2000,
    "errorCount" : 1830,
    "errorPct" : 91.5,
    "meanResTime" : 9554.916499999974,
    "medianResTime" : 10001.0,
    "minResTime" : 372.0,
    "maxResTime" : 10003.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10002.0,
    "throughput" : 12.524422624117028,
    "receivedKBytesPerSec" : 30.309897757658685,
    "sentKBytesPerSec" : 0.25262885673939184
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5200,
    "errorCount" : 2979,
    "errorPct" : 57.28846,
    "meanResTime" : 4779.008653846153,
    "medianResTime" : 196.0,
    "minResTime" : 0.0,
    "maxResTime" : 10003.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10002.0,
    "throughput" : 32.563498822704275,
    "receivedKBytesPerSec" : 47.32593425343482,
    "sentKBytesPerSec" : 3.145134477074045
  },
  "Login for Token" : {
    "transaction" : "Login for Token",
    "sampleCount" : 600,
    "errorCount" : 549,
    "errorPct" : 91.5,
    "meanResTime" : 9563.954999999994,
    "medianResTime" : 10001.0,
    "minResTime" : 448.0,
    "maxResTime" : 10002.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10002.0,
    "throughput" : 6.68881407326481,
    "receivedKBytesPerSec" : 16.187354640225415,
    "sentKBytesPerSec" : 0.13491938933914518
  },
  "GET /restaurants?q=ramen" : {
    "transaction" : "GET /restaurants?q=ramen",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.898000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 33.5042047776996,
    "receivedKBytesPerSec" : 19.206023637216468,
    "sentKBytesPerSec" : 4.48249614701645
  },
  "POST /reviews/" : {
    "transaction" : "POST /reviews/",
    "sampleCount" : 600,
    "errorCount" : 600,
    "errorPct" : 100.0,
    "meanResTime" : 1.4049999999999994,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 4.0,
    "throughput" : 6.7444526876643955,
    "receivedKBytesPerSec" : 1.3346639576448371,
    "sentKBytesPerSec" : 2.0482652530012815
  }
}