jmeter/results/report_500/statistics.json
{
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 5000,
    "errorCount" : 5000,
    "errorPct" : 100.0,
    "meanResTime" : 10001.237600000004,
    "medianResTime" : 10001.0,
    "minResTime" : 10000.0,
    "maxResTime" : 10012.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10003.0,
    "throughput" : 31.276193812317818,
    "receivedKBytesPerSec" : 81.82512033515569,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 13000,
    "errorCount" : 8000,
    "errorPct" : 61.53846,
    "meanResTime" : 5001.0739230769,
    "medianResTime" : 5008.5,
    "minResTime" : 0.0,
    "maxResTime" : 10013.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10002.0,
    "throughput" : 81.31810391202632,
    "receivedKBytesPerSec" : 126.17073146416372,
    "sentKBytesPerSec" : 6.924133923098094
  },
  "Login for Token" : {
    "transaction" : "Login for Token",
    "sampleCount" : 1500,
    "errorCount" : 1500,
    "errorPct" : 100.0,
    "meanResTime" : 10001.276666666663,
    "medianResTime" : 10001.0,
    "minResTime" : 10000.0,
    "maxResTime" : 10013.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10003.0,
    "throughput" : 16.68687632799724,
    "receivedKBytesPerSec" : 43.656388362016216,
    "sentKBytesPerSec" : 0.0
  },
  "GET /restaurants?q=ramen" : {
    "transaction" : "GET /restaurants?q=ramen",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.839599999999998,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 83.49057391420509,
    "receivedKBytesPerSec" : 47.86031922620936,
    "sentKBytesPerSec" : 11.170125611568453
  },
  "POST /reviews/" : {
    "transaction" : "POST /reviews/",
    "sampleCount" : 1500,
    "errorCount" : 1500,
    "errorPct" : 100.0,
    "meanResTime" : 1.1066666666666658,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 18.776521837094897,
    "receivedKBytesPerSec" : 3.7406352097337487,
    "sentKBytesPerSec" : 5.482597684854857
  }
}